Repository: gargullia/luci
Catalog: protocols/luci-proto-amneziawg/po/*/amneziawg.po
Languages: ru

source: AmneziaWG
ru: AmneziaWG (VPN-протокол)

source: AmneziaWG Settings
ru: Настройки AmneziaWG

source: AmneziaWG Status
ru: Состояние AmneziaWG

source: AmneziaWG VPN
ru: AmneziaWG ВПН

source: AmneziaWG peer is disabled
ru: Узел AmneziaWG отключён

source: Cookie reply packet junk header size.
ru: Размер мусорного заголовка пакета ответа cookie.

source: DNS servers for the remote clients using this tunnel to your openwrt device. Some amneziawg clients require this to be set.
ru: DNS-серверы для удалённых клиентов, использующих этот туннель к вашему устройству openwrt. Некоторые клиенты amneziawg требуют установки этого параметра.

# Label indicating that AmneziaWG peer is disabled
source: Disabled
ru: Отключено

source: Drag or paste a valid <em>*.conf</em> file below to configure the local AmneziaWG interface.
ru: Перетащите или вставьте правильный файл <em>*.conf</em> ниже, чтобы настроить локальный интерфейс AmneziaWG.

source: Enable / Disable peer. Restart amneziawg interface to apply changes.
ru: Включить/выключить узел. Перезапустите интерфейс AmneziaWG, чтобы применить изменения.

source: Fifth special junk packet signature.
ru: Сигнатура пятого special junk пакета.

source: First special junk packet signature.
ru: Сигнатура первого special junk пакета.

source: Fourth special junk packet signature.
ru: Сигнатура четвертого special junk пакета.

source: Further information about AmneziaWG interfaces and peers at <a href='https://docs.amnezia.org/documentation/amnezia-wg'>amnezia.org</a>.
ru: Дополнительная информация об AmneziaWG интерфейсах и узлах приведена по адресу <a href='https://docs.amnezia.org/documentation/amnezia-wg'>amnezia.org</a>.

source: Generates a configuration suitable for import on a AmneziaWG peer
ru: Создает конфигурацию, подходящую для импорта на узле AmneziaWG

source: Grant access to LuCI AmneziaWG procedures
ru: Предоставить доступ к LuCI AmneziaWG процедурам

source: Handshake cookie packet type header.
ru: Тип заголовка пакета под нагрузкой.

source: Handshake initiation packet junk header size.
ru: Размер мусорного заголовка пакета инициации рукопожатия.

source: Handshake initiation packet type header.
ru: Тип заголовка пакета инициации рукопожатия.

source: Handshake response packet junk header size.
ru: Размер мусорного заголовка пакета ответа на рукопожатие.

source: Handshake response packet type header.
ru: Тип заголовка пакета ответа на рукопожатие.

source: Imports settings from an existing AmneziaWG configuration file
ru: Импортирует настройки из существующего файла конфигурации AmneziaWG

# AmneziaWG instance heading
source: Instance "%h"
ru: Экземпляр «%h»

source: Junk packet count.
ru: Количество мусорных пакетов.

source: Junk packet maximum size.
ru: Максимальный размер мусорного пакета.

source: Junk packet minimum size.
ru: Минимальный размер мусорного пакета.

# Label indicating that AmneziaWG peer lacks public key
source: Key missing
ru: Отсутствует ключ

# No AmneziaWG peer handshake yet
source: Never
ru: Никогда

source: No AmneziaWG interfaces configured.
ru: Интерфейсы AmneziaWG не настроены.

source: No fixed interface listening port defined, peers might not be able to initiate connections to this AmneziaWG instance!
ru: Не определен фиксированный порт прослушивания интерфейса, поэтому узлы могут оказаться не в состоянии инициировать соединения с этим экземпляром AmneziaWG!

source: Optional. Private key of the AmneziaWG peer. The key is not required for establishing a connection but allows generating a peer configuration or QR code if available. It can be removed after the configuration has been exported.
ru: Необязательно. Закрытый ключ узла AmneziaWG. Ключ не требуется для установления соединения, но позволяет сгенерировать конфигурацию узла или QR-код, если он доступен. Он может быть удален после экспорта конфигурации.

source: Paste or drag AmneziaWG peer configuration (wg0.conf) file…
ru: Вставьте или перетащите файл конфигурации узлов AmneziaWG (wg0.conf)…

source: Paste or drag a AmneziaWG configuration (commonly <em>wg0.conf</em>) from another system below to create a matching peer entry allowing that system to connect to the local AmneziaWG interface.
ru: Вставьте или перетащите конфигурацию AmneziaWG (обычно <em>wg0.conf</em>) из другой системы ниже, чтобы создать соответствующую запись узла, позволяющую этой системе подключиться к локальному интерфейсу AmneziaWG.

source: Paste or drag supplied AmneziaWG configuration file…
ru: Вставьте или перетащите имеющийся файл конфигурации AmneziaWG…

# AmneziaWG listen port
source: Port %d
ru: Порт %d

# Label indicating that AmneziaWG peer private key is stored
source: Private
ru: Частный

# Tooltip displaying full AmneziaWG peer public key
source: Public key: %h
ru: Публичный ключ: %h

source: Recommended. IP addresses of the AmneziaWG interface.
ru: Рекомендуемый. IP адреса интерфейса AmneziaWG.

source: Required. Public key of the AmneziaWG peer.
ru: Обязательно. Публичный ключ AmneziaWG узла.

source: Second special junk packet signature.
ru: Сигнатура второго special junk пакета.

source: The generated configuration can be imported into a AmneziaWG client application to set up a connection towards this device.
ru: Сгенерированная конфигурация может быть импортирована в клиентское приложение AmneziaWG для установки соединения с этим устройством.

source: Third special junk packet signature.
ru: Сигнатура третьего special junk пакета.

source: To configure fully the local AmneziaWG interface from an existing (e.g. provider supplied) configuration file, use the <strong><a class="full-import" href="#">configuration import</a></strong> instead.
ru: Чтобы полностью настроить локальный интерфейс AmneziaWG из существующего (например, предоставленного провайдером) файла конфигурации, используйте вместо этого <strong><a class="full-import" href="#">импорт конфигурации</a></strong>.

source: Transport packet junk header size.
ru: Размер мусорного заголовка транспортного пакета.

source: Transport packet type header.
ru: Тип заголовка транспортного пакета.

# AmneziaWG keep alive interval
source: every %ds
ru: каждые %dс
